Matiu-f/ArduinoCore-mbed/boards.txt
nicla_vision.debug.tool=gdb
nicla_vision.bootloader.tool=openocd
nicla_vision.bootloader.tool.default=openocd
nicla_vision.bootloader.config=-f target/stm32h7x_dual_bank.cfg
nicla_vision.bootloader.programmer=-f interface/stlink.cfg
nicla_vision.bootloader.extra_action.preflash=stm32h7x option_write 0 0x01c 0xb86aaf0
nicla_vision.bootloader.file=NICLA_VISION/bootloader.hex

nicla_vision.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_vision.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_vision.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
nicla_vision.debug.cortex-debug.custom.request=attach
nicla_vision.menu.target_core.cm7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
nicla_vision.menu.target_core.cm4.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM4.svd

##############################################################

opta.name=Opta
opta.build.core=arduino
opta.build.crossprefix=arm-none-eabi-
opta.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/

opta.menu.target_core.cm7=Main Core
opta.menu.target_core.cm4=M4 Co-processor

opta.menu.split.100_0=2MB M7
opta.menu.split.75_25=1.5MB M7 + 0.5MB M4
opta.menu.split.50_50=1MB M7 + 1MB M4

opta.menu.security.none=None
opta.menu.security.sien=Signature + Encryption

opta.menu.target_core.cm7.build.variant=OPTA
opta.menu.target_core.cm7.build.mcu=cortex-m7
opta.menu.target_core.cm7.build.fpu=-mfpu=fpv5-d16
opta.menu.target_core.cm7.build.architecture=cortex-m7
opta.menu.target_core.cm7.compiler.mbed.arch.define=

opta.menu.target_core.cm4.build.variant=GENERIC_STM32H747_M4
opta.menu.target_core.cm4.build.mcu=cortex-m4
opta.menu.target_core.cm4.build.fpu=-mfpu=fpv4-sp-d16
opta.menu.target_core.cm4.build.architecture=cortex-m4
opta.menu.target_core.cm4.compiler.mbed.arch.define=-DOPTA_PINS

opta.build.float-abi=-mfloat-abi=softfp
opta.build.extra_flags=
opta.menu.split.50_50.build.extra_ldflags=-DCM4_BINARY_START=0x08100000 -DCM4_BINARY_END=0x08200000
opta.menu.split.75_25.build.extra_ldflags=-DCM4_BINARY_START=0x08180000 -DCM4_BINARY_END=0x08200000
opta.menu.split.100_0.build.extra_ldflags=-DCM4_BINARY_START=0x60000000 -DCM4_BINARY_END=0x60040000 -DCM4_RAM_END=0x60080000

opta.build.board={build.variant}
opta.build.ldscript=linker_script.ld
opta.compiler.mbed.arch.define=
opta.build.slot_size=0x1E0000
opta.build.header_size=0x20000
opta.build.alignment=32
opta.build.version=1.2.3+4
opta.menu.security.sien.recipe.hooks.objcopy.postobjcopy.1.pattern="{tools.imgtool.path}/{tools.imgtool.cmd}" {tools.imgtool.flags}
opta.menu.security.sien.build.keys.keychain={runtime.platform.path}/libraries/MCUboot/default_keys
opta.menu.security.sien.build.keys.sign_key=ecdsa-p256-signing-priv-key.pem
opta.menu.security.sien.build.keys.encrypt_key=ecdsa-p256-encrypt-pub-key.pem
opta.compiler.mbed.defines={build.variant.path}/defines.txt
opta.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
opta.compiler.mbed.cflags={build.variant.path}/cflags.txt
opta.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
opta.compiler.mbed.includes={build.variant.path}/../OPTA/includes.txt
opta.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
opta.compiler.mbed="{build.variant.path}/libs/libmbed.a"
opta.vid.0=0x2341
opta.pid.0=0x0064
opta.vid.1=0x2341
opta.pid.1=0x0164
opta.vid.2=0x2341
opta.pid.2=0x0264
opta.vid.3=0x2341
opta.pid.3=0x0364
opta.vid.4=0x35d1
opta.pid.4=0x0064
opta.vid.5=0x35d1
opta.pid.5=0x0164
opta.vid.6=0x35d1
opta.pid.6=0x0264
opta.vid.7=0x35d1
opta.pid.7=0x0364
opta.upload_port.0.vid=0x2341
opta.upload_port.0.pid=0x0064
opta.upload_port.1.vid=0x2341
opta.upload_port.1.pid=0x0164
opta.upload_port.2.vid=0x2341
opta.upload_port.2.pid=0x0264
opta.upload_port.3.vid=0x2341
opta.upload_port.3.pid=0x0364
opta.upload_port.4.vid=0x35d1
opta.upload_port.4.pid=0x0064
opta.upload_port.5.vid=0x35d1
opta.upload_port.5.pid=0x0164
opta.upload_port.6.vid=0x35d1
opta.upload_port.6.pid=0x0264
opta.upload_port.7.vid=0x35d1
opta.upload_port.7.pid=0x0364

opta.upload.tool=dfu-util
opta.upload.tool.default=dfu-util
opta.upload.protocol=
opta.upload.transport=
opta.upload.vid=0x2341
opta.upload.pid=0x0364
opta.upload.address=0x08040000
opta.upload.interface=0
opta.upload.use_1200bps_touch=true
opta.upload.wait_for_upload_port=true
opta.upload.native_usb=true
opta.upload.maximum_size=1966080
opta.upload.maximum_data_size=523624

opta.menu.security.none.upload.interface=0
opta.menu.security.sien.upload.interface=2

opta.menu.security.none.upload.address_m7=0x08040000
opta.menu.security.sien.upload.address_m7=0xA0000000
opta.menu.target_core.cm7.upload.address={upload.address_m7}

opta.menu.target_core.cm7.menu.split.50_50.upload.maximum_size=786432
opta.menu.target_core.cm7.menu.split.75_25.upload.maximum_size=1441792
opta.menu.target_core.cm7.menu.split.100_0.upload.maximum_size=1966080
opta.menu.target_core.cm7.upload.maximum_data_size=523624

opta.menu.split.50_50.upload.address_m4=0x08100000
opta.menu.split.75_25.upload.address_m4=0x08180000
#make loading the M4 in this way fail - the user needs to provide a file via mass storage or similar interfaces
opta.menu.split.100_0.upload.address_m4=
opta.menu.target_core.cm4.upload.address={upload.address_m4}
opta.menu.target_core.cm4.menu.split.50_50.upload.maximum_size=1048576
opta.menu.target_core.cm4.menu.split.75_25.upload.maximum_size=524288
opta.menu.target_core.cm4.menu.split.100_0.upload.maximum_size=524288
opta.menu.target_core.cm4.upload.maximum_data_size=294248

opta.debug.tool=gdb
opta.bootloader.tool=openocd
opta.bootloader.tool.default=openocd
opta.bootloader.config=-f target/stm32h7x_dual_bank.cfg
opta.bootloader.programmer=-f interface/stlink.cfg
opta.bootloader.extra_action.preflash=stm32h7x option_write 0 0x01c 0xb86aaf0
opta.bootloader.file=OPTA/bootloader.hex

opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
opta.debug.server.openocd.scripts.1={programmer.transport_script}
opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
opta.debug.cortex-debug.custom.request=attach
opta.menu.target_core.cm7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
opta.menu.target_core.cm4.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM4.svd

