Matiu-f/ArduinoCore-mbed/boards.txt
ArduPower.upload.use_1200bps_touch=true
ArduPower.upload.wait_for_upload_port=true
ArduPower.upload.native_usb=true

ArduPower.menu.security.none.upload.interface=0
ArduPower.menu.security.sien.upload.interface=2

ArduPower.menu.security.none.upload.address_m7=0x08040000
ArduPower.menu.security.sien.upload.address_m7=0xA0000000
ArduPower.menu.target_core.cm7.upload.address={upload.address_m7}

ArduPower.menu.target_core.cm7.menu.split.50_50.upload.maximum_size=786432
ArduPower.menu.target_core.cm7.menu.split.75_25.upload.maximum_size=1441792
ArduPower.menu.target_core.cm7.menu.split.100_0.upload.maximum_size=1966080
ArduPower.menu.target_core.cm7.upload.maximum_data_size=523624

ArduPower.menu.split.50_50.upload.address_m4=0x08100000
ArduPower.menu.split.75_25.upload.address_m4=0x08180000
#make loading the M4 in this way fail - the user needs to provide a file via mass storage or similar interfaces
ArduPower.menu.split.100_0.upload.address_m4=
ArduPower.menu.target_core.cm4.upload.address={upload.address_m4}
ArduPower.menu.target_core.cm4.menu.split.50_50.upload.maximum_size=1048576
ArduPower.menu.target_core.cm4.menu.split.75_25.upload.maximum_size=524288
ArduPower.menu.target_core.cm4.menu.split.100_0.upload.maximum_size=524288
ArduPower.menu.target_core.cm4.upload.maximum_data_size=294248

ArduPower.debug.tool=gdb
ArduPower.bootloader.tool=openocd
ArduPower.bootloader.tool.default=openocd
ArduPower.bootloader.config=-f target/stm32h7x_dual_bank.cfg
ArduPower.bootloader.programmer=-f interface/stlink.cfg
ArduPower.bootloader.extra_action.preflash=stm32h7x option_write 0 0x01c 0xb86aaf0
ArduPower.bootloader.file=PORTENTA_H7/portentah7_bootloader_mbed_hs_v2.elf

ArduPower.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
ArduPower.debug.server.openocd.scripts.1={programmer.transport_script}
ArduPower.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
ArduPower.debug.cortex-debug.custom.request=attach
ArduPower.menu.target_core.cm7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
ArduPower.menu.target_core.cm4.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM4.svd

ArduPower_thread_debug.name=Arduino Portenta H7 (ThreadDebug)
ArduPower_thread_debug.vid.0=0x2341
ArduPower_thread_debug.pid.0=0x025B
ArduPower_thread_debug.upload_port.0.vid=0x2341
ArduPower_thread_debug.upload_port.0.pid=0x025B
ArduPower_thread_debug.descriptor.0=DebugPort
ArduPower_thread_debug.hide=true
ArduPower_thread_debug.build.board=PORTENTA_H7_M7
